[
  {
    "slug": "bienvenida",
    "title": "Bienvenido a mi blog",
    "date": "2024-03-24T00:00:00.000Z",
    "excerpt": "Este es mi primer artículo en mi nuevo blog minimalista escrito en Markdown.",
    "contentHtml": "<h1>Bienvenido a mi blog</h1>\n<p>Soy Juanan Ruiz, un entusiasta de la tecnología y el aprendizaje continuo. Este es un blog minimalista donde puedo escribir artículos usando Markdown. La simplicidad es clave para una buena experiencia de lectura. </p>\n<h2>¿Por qué Markdown?</h2>\n<p>Markdown es una forma sencilla de formatear texto que se convierte en HTML válido. Algunas de sus ventajas son:</p>\n<ul>\n<li><strong>Simplicidad</strong>: Es fácil de aprender y usar</li>\n<li><strong>Portabilidad</strong>: Los archivos Markdown son archivos de texto plano</li>\n<li><strong>Flexibilidad</strong>: Se puede convertir a muchos formatos diferentes</li>\n</ul>\n<h2>Ejemplos de formato</h2>\n<p>Puedes usar <strong>negrita</strong> o <em>cursiva</em> para enfatizar texto.</p>\n<p>También puedes incluir:</p>\n<ol>\n<li>Listas numeradas</li>\n<li>Como esta</li>\n</ol>\n<p>O enlaces a <a href=\"https://example.com\">otros sitios web</a>.</p>\n<p>Y a otras páginas de mi blog:</p>\n<ul>\n<li><a href=\"vercel-que-es\">¿Qué es Vercel?</a></li>\n<li><a href=\"youtube-aprendizaje\">Aprendizaje con YouTube</a></li>\n</ul>\n<p>Incluso apartados dentro de un artículo del blog:</p>\n<ul>\n<li><a href=\"vercel-que-es#art%C3%ADculos-relacionados\">¿Qué es Vercel?</a></li>\n</ul>\n<pre><code class=\"language-javascript\">// Incluso puedes incluir bloques de código\nfunction saludar() {\n  console.log(&quot;¡Hola, mundo!&quot;);\n}\n</code></pre>\n"
  },
  {
    "slug": "vercel-que-es",
    "title": "¿Qué es Vercel?",
    "date": "2024-03-24T00:00:00.000Z",
    "excerpt": "Introducción a Vercel: la plataforma de despliegue para sitios web y aplicaciones",
    "contentHtml": "<h1>¿Qué es Vercel?</h1>\n<p>Vercel es una plataforma de despliegue para sitios web y aplicaciones. Es una de las plataformas de despliegue más populares y es conocida por su facilidad de uso y su integración con otros servicios de desarrollo web.</p>\n<h2>Características principales</h2>\n<ol>\n<li><strong>Facilidad de uso</strong>: Vercel es conocida por su interface intuitiva y su facilidad de uso.</li>\n<li><strong>Integración con otros servicios</strong>: Vercel se integra con otros servicios de desarrollo web, como GitHub, GitLab y Bitbucket.</li>\n<li><strong>Creación de código con V0</strong>: Vercel está integrado con V0, un editor de código integrado que permite crear y editar código de manera sencilla utilizando Inteligencia Artificial.</li>\n<li><strong>Despliegue automático</strong>: Vercel ofrece despliegue automático, lo que significa que los cambios en el código se despliegan automáticamente.</li>\n<li><strong>Costo</strong>: Vercel es un servicio pago, pero ofrece un plan gratuito que es suficiente para la mayoría de los usuarios.</li>\n</ol>\n<h3>Templates</h3>\n<ul>\n<li><a href=\"https://vercel.com/templates/next.js/blog-starter-kit\">Blog Starter Kit</a></li>\n</ul>\n<h2>Artículos relacionados</h2>\n<ul>\n<li>[[Netlify-que-es]]</li>\n</ul>\n"
  },
  {
    "slug": "youtube-aprendizaje",
    "title": "YouTube para el aprendizaje",
    "date": "2024-03-24T00:00:00.000Z",
    "excerpt": "Consejos y trucos para utilizar YouTube como herramienta de aprendizaje",
    "contentHtml": "<p>Sugerencias  y trucos para aprovechar al máximo YouTube como herramienta de aprendizaje, independientemente del tema de estudio.</p>\n<ol>\n<li>Optimiza tu búsqueda:<ul>\n<li>Usa palabras clave específicas.</li>\n<li>Agrega términos como &quot;tutorial&quot;, &quot;curso&quot;, &quot;explicación&quot; o &quot;lección&quot; a tu búsqueda.</li>\n<li>Utiliza filtros para refinar los resultados por duración, fecha de subida, etc.</li>\n</ul>\n</li>\n<li>Aprovecha las funciones de YouTube:<ul>\n<li>Crea listas de reproducción temáticas para organizar tu aprendizaje.</li>\n<li>Usa la función &quot;Guardar&quot; para volver a videos importantes más tarde.</li>\n<li>Activa las notificaciones de canales educativos que te gusten.</li>\n</ul>\n</li>\n<li>Mejora la comprensión:<ul>\n<li>Activa los subtítulos, especialmente útiles para videos en otros idiomas.</li>\n<li>Ajusta la velocidad de reproducción según tus necesidades.</li>\n<li>Usa la función de transcripción para revisar el contenido rápidamente.</li>\n</ul>\n</li>\n<li>Interactúa y participa:<ul>\n<li>Lee y participa en los comentarios para discutir y aclarar dudas.</li>\n<li>Utiliza la función de marcadores de tiempo en los comentarios para señalar partes importantes.</li>\n<li>Considera hacer tus propios videos de resumen para reforzar lo aprendido.</li>\n</ul>\n</li>\n<li>Explora contenido relacionado:<ul>\n<li>Revisa las sugerencias de videos relacionados en la barra lateral.</li>\n<li>Busca canales especializados en tu área de interés y suscríbete.</li>\n<li>Explora las listas de reproducción creadas por otros usuarios.</li>\n</ul>\n</li>\n<li>Técnicas de estudio con YouTube:<ul>\n<li>Practica la técnica Pomodoro: estudia con videos durante 25 minutos, luego toma un descanso de 5 minutos.</li>\n<li>Toma notas mientras ves los videos para mantener la concentración y retener información.</li>\n<li>Haz resúmenes o mapas conceptuales después de ver una serie de videos sobre un tema.</li>\n</ul>\n</li>\n<li>Verifica la credibilidad:<ul>\n<li>Revisa las credenciales del creador del contenido.</li>\n<li>Compara la información con otras fuentes confiables.</li>\n<li>Presta atención a la fecha de publicación para asegurarte de que la información esté actualizada.</li>\n</ul>\n</li>\n<li>Usa extensiones y herramientas complementarias:<ul>\n<li>Instala extensiones de navegador que bloqueen anuncios o mejoren la experiencia de visualización.</li>\n<li>Utiliza herramientas como Video Speed Controller para un control más preciso de la velocidad.</li>\n<li>Considera usar aplicaciones de toma de notas que se integren con YouTube.</li>\n<li>Prueba la extensión <a href=\"https://www.languagereactor.com/\">Language Reactor</a> para aprender idiomas ¡es una pasada!</li>\n</ul>\n</li>\n<li>Aprendizaje activo:<ul>\n<li>Pausa el video regularmente para reflexionar sobre lo que has aprendido.</li>\n<li>Intenta explicar el concepto con tus propias palabras después de ver un video. Ten siempre una [[herramienta de toma de notas]] abierta</li>\n<li>Busca formas de aplicar prácticamente lo que has aprendido.</li>\n</ul>\n</li>\n<li>Combina con otros recursos:</li>\n</ol>\n<ul>\n<li>Usa YouTube junto con libros de texto, artículos o cursos en línea para un aprendizaje más completo.</li>\n<li>Busca videos que complementen lo que estás aprendiendo en clase o en otros recursos.</li>\n</ul>\n<ol start=\"11\">\n<li>Aprovecha las comunidades de aprendizaje:</li>\n</ol>\n<ul>\n<li>Únete a grupos de estudio en línea que compartan recursos de YouTube.</li>\n<li>Participa en foros relacionados con tu tema de interés y comparte videos útiles.</li>\n</ul>\n"
  }
]